# 06. 누락값 처리하기
## 06-1. 누락값이란?

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [3]:
os.chdir('C:\\Users\\James\\Documents\\GitHub\\doit_pandas\\data')
os.getcwd()

'C:\\Users\\James\\Documents\\GitHub\\doit_pandas\\data'

In [4]:
from numpy import NaN, NAN, nan

In [5]:
pd.isnull(NaN)

True

In [6]:
pd.isnull(nan)

True

In [7]:
pd.isnull(NAN)

True

In [8]:
pd.notnull(NaN)

False

In [9]:
pd.notnull('missing')

True

In [10]:
visited = pd.read_csv('survey_visited.csv')
survey = pd.read_csv('survey_survey.csv')

In [13]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [14]:
survey

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [15]:
vs = visited.merge(survey, left_on = 'ident', right_on = 'taken')
vs

    ident   site       dated  taken person quant  reading
0     619   DR-1  1927-02-08    619   dyer   rad     9.82
1     619   DR-1  1927-02-08    619   dyer   sal     0.13
2     622   DR-1  1927-02-10    622   dyer   rad     7.80
3     622   DR-1  1927-02-10    622   dyer   sal     0.09
4     734   DR-3  1939-01-07    734     pb   rad     8.41
5     734   DR-3  1939-01-07    734   lake   sal     0.05
6     734   DR-3  1939-01-07    734     pb  temp   -21.50
7     735   DR-3  1930-01-12    735     pb   rad     7.22
8     735   DR-3  1930-01-12    735    NaN   sal     0.06
9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
10    751   DR-3  1930-02-26    751     pb   rad     4.35
11    751   DR-3  1930-02-26    751     pb  temp   -18.50
12    751   DR-3  1930-02-26    751   lake   sal     0.10
13    752   DR-3         NaN    752   lake   rad     2.19
14    752   DR-3         NaN    752   lake   sal     0.09
15    752   DR-3         NaN    752   lake  temp   -16.00
16    752   DR-3         NaN    752    roe   sal    41.60
17    837  MSK-4  1932-01-14    837   lake   rad     1.46
18    837  MSK-4  1932-01-14    837   lake   sal     0.21
19    837  MSK-4  1932-01-14    837    roe   sal    22.50
20    844   DR-1  1932-03-22    844    roe   rad    11.25

In [17]:
num_legs = pd.Series({'goat': 4, 'amoeba': NaN})
num_legs

goat      4.0
amoeba    NaN
dtype: float64

In [18]:
type(num_legs)

pandas.core.series.Series

In [20]:
scientists = pd.DataFrame({'Name'       : ['Rosaline Franklin', 'William Gosset'],
                           'Occupation' : ['Chemist', 'Statistician'],
                           'Born'       : ['1920-07-25', '1876-06-13'],
                           'Died'       : ['1958-04-16', '1937-10-16'],
                           'missing'    : [NaN, nan]})
scientists

                Name    Occupation        Born        Died  missing
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16      NaN
1     William Gosset  Statistician  1876-06-13  1937-10-16      NaN

In [21]:
gapminder = pd.read_csv('gapminder.tsv', sep='\t')
gapminder.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [41]:
life_exp_df = gapminder.groupby('year', as_index = True).agg(life_mean = ('lifeExp', 'mean')).sort_values('life_mean', ascending = False)
life_exp_df

      life_mean
year
2007  67.007423
2002  65.694923
1997  65.014676
1992  64.160338
1987  63.212613
1982  61.533197
1977  59.570157
1972  57.647386
1967  55.678290
1962  53.609249
1957  51.507401
1952  49.057620

In [42]:
type(life_exp_df)

pandas.core.frame.DataFrame

In [45]:
life_exp_sr = gapminder.groupby('year')['lifeExp'].mean()
life_exp_sr

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [46]:
type(life_exp_sr)

pandas.core.series.Series

In [49]:
y2000 = life_exp_sr[life_exp_sr.index > 2000]
y2000

year
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64